hdscmcu/hc32m120/DeviceDriverLibrary/hc32m120_ddl/driver/src/hc32m120_usart.c
/**
 *******************************************************************************
 * @file  hc32m120_usart.c
 * @brief This file provides firmware functions to manage the USART.
 @verbatim
   Change Logs:
   Date             Author          Notes
   2019-07-03       Hongjh          First version
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2016, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software is owned and published by:
 * Huada Semiconductor Co., Ltd. ("HDSC").
 *
 * BY DOWNLOADING, INSTALLING OR USING THIS SOFTWARE, YOU AGREE TO BE BOUND
 * BY ALL THE TERMS AND CONDITIONS OF THIS AGREEMENT.
 *
 * This software contains source code for use with HDSC
 * components. This software is licensed by HDSC to be adapted only
 * for use in systems utilizing HDSC components. HDSC shall not be
 * responsible for misuse or illegal use of this software for devices not
 * supported herein. HDSC is providing this software "AS IS" and will
 * not be responsible for issues arising from incorrect user implementation
 * of the software.
 *
 * Disclaimer:
 * HDSC MAKES NO WARRANTY, EXPRESS OR IMPLIED, ARISING BY LAW OR OTHERWISE,
 * REGARDING THE SOFTWARE (INCLUDING ANY ACCOMPANYING WRITTEN MATERIALS),
 * ITS PERFORMANCE OR SUITABILITY FOR YOUR INTENDED USE, INCLUDING,
 * WITHOUT LIMITATION, THE IMPLIED WARRANTY OF MERCHANTABILITY, THE IMPLIED
 * WARRANTY OF FITNESS FOR A PARTICULAR PURPOSE OR USE, AND THE IMPLIED
 * WARRANTY OF NONINFRINGEMENT.
 * HDSC SHALL HAVE NO LIABILITY (WHETHER IN CONTRACT, WARRANTY, TORT,
 * NEGLIGENCE OR OTHERWISE) FOR ANY DAMAGES WHATSOEVER (INCLUDING, WITHOUT
 * LIMITATION, DAMAGES FOR LOSS OF BUSINESS PROFITS, BUSINESS INTERRUPTION,
 * LOSS OF BUSINESS INFORMATION, OR OTHER PECUNIARY LOSS) ARISING FROM USE OR
 * INABILITY TO USE THE SOFTWARE, INCLUDING, WITHOUT LIMITATION, ANY DIRECT,
 * INDIRECT, INCIDENTAL, SPECIAL OR CONSEQUENTIAL DAMAGES OR LOSS OF DATA,
 * SAVINGS OR PROFITS,
 * EVEN IF Disclaimer HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * YOU ASSUME ALL RESPONSIBILITIES FOR SELECTION OF THE SOFTWARE TO ACHIEVE YOUR
 * INTENDED RESULTS, AND FOR THE INSTALLATION OF, USE OF, AND RESULTS OBTAINED
 * FROM, THE SOFTWARE.
 *
 * This software may be replicated in part or whole for the licensed use,
 * with the restriction that this Disclaimer and Copyright notice must be
 * included with each copy of this software, whether used in part or whole,
 * at all times.
 *******************************************************************************
 */

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32m120_usart.h"
#include "hc32m120_utility.h"

/**
 * @addtogroup HC32M120_DDL_Driver
 * @{
 */

/**
 * @defgroup DDL_USART USART
 * @brief USART Driver Library
 * @{
 */

#if (DDL_USART_ENABLE == DDL_ON)

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup USART_Local_Macros USART Local Macros
 * @{
 */

/**
 * @defgroup USART_Check_Parameters_Validity USART Check Parameters Validity
 * @{
 */

#define IS_USART_INSTANCE(x)                                                   \
(   (M0P_USART1 == (x))                         ||                             \
    (M0P_USART2 == (x))                         ||                             \
    (M0P_USART3 == (x)))

#define IS_USART_FLAG(x)                                                       \
(   (x) & (USART_FLAG_PE | USART_FLAG_FE | USART_FLAG_TC |                     \
    USART_FLAG_ORE | USART_FLAG_MPB | USART_FLAG_TXE | USART_FLAG_RXNE))

#define IS_USART_CLEAR_FLAG(x)                                                 \
(    (x) & (USART_CLEAR_FLAG_PE | USART_CLEAR_FLAG_FE | USART_CLEAR_FLAG_ORE))

#define IS_USART_TRANSMISSION_TYPE(x)                                          \
(   (USART_TRANSMISSION_ID == (x))              ||                             \
    (USART_TRANSMISSION_DATA == (x)))

#define IS_USART_TRANSMIT_RECEIVE_FUNCTION(x)                                  \
(    (x) & (USART_RX | USART_TX | USART_INT_RX | USART_INT_TC | USART_INT_TXE))

#define IS_USART_PARITY_CONTROL(x)                                             \
(   (USART_PARITY_ODD == (x))                   ||                             \
    (USART_PARITY_EVEN == (x))                  ||                             \
    (USART_PARITY_NONE == (x)))

#define IS_USART_DATA_WIDTH(x)                                                 \
(   (USART_DATA_WIDTH_BITS_8 == (x))            ||                             \
    (USART_DATA_WIDTH_BITS_9 == (x)))

#define IS_USART_NOISE_FILTER(x)                                               \
(   (USART_NOISE_FILTER_ENABLE == (x))          ||                             \
    (USART_NOISE_FILTER_DISABLE == (x)))

#define IS_USART_OVERSAMPLING_BITS(x)                                          \
(   (USART_OVERSAMPLING_BITS_8 == (x))          ||                             \
    (USART_OVERSAMPLING_BITS_16 == (x)))

#define IS_USART_MODE_SEL(x)                                                   \
(   (USART_MODE_UART == (x))                    ||                             \
    (USART_MODE_CLKSYNC == (x)))

#define IS_USART_SIGNIFICANT_BIT(x)                                            \
(   (USART_MSB == (x))                          ||                             \
    (USART_LSB == (x)))

#define IS_USART_SB_DETECT_POLARITY(x)                                         \
(   (USART_SB_DETECT_LOW == (x))                ||                             \
    (USART_SB_DETECT_FALLING == (x)))

