hdscmcu/hc32m120/DeviceDriverLibrary/hc32m120_ddl/driver/src/hc32m120_usart.c
    /* Check USARTx instance */
    if (IS_USART_INSTANCE(USARTx))
    {
        /* Configures the registers to reset value. */
        WRITE_REG32(USARTx->CR1, (USART_CR1_CPE | USART_CR1_CFE | USART_CR1_CORE));
        WRITE_REG32(USARTx->PR, 0x00000000ul);
        WRITE_REG32(USARTx->BRR, 0x0000FF00ul);
        WRITE_REG32(USARTx->CR1, 0x80000000ul);
        WRITE_REG32(USARTx->CR2, 0x00000000ul);
        WRITE_REG32(USARTx->CR3, 0x00000000ul);
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Enable/disable USART Transmit/Receive Function.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_USART1:           USART unit 1 instance register base
 *           @arg M0P_USART2:           USART unit 2 instance register base
 *           @arg M0P_USART3:           USART unit 3 instance register base
 * @param  [in] u32Func                 USART function type
 *         This parameter can be any composed value of the following values:
 *           @arg USART_RX:             USART RX function
 *           @arg USART_TX:             USART TX function
 *           @arg USART_INT_RX:         USART RX interrupt function
 *           @arg USART_INT_TC:         USART transmission complete interrupt
 *           @arg USART_INT_TXE:        Transmit data register empty interrupt
 * @param  [in] enNewSta                The function new state.
 *           @arg  This parameter can be: Enable or Disable.
 * @retval An en_result_t enumeration value:
 *           - Ok: Set successfully
 *           - ErrorInvalidParameter: USARTx is invalid instance
 */
en_result_t USART_FuncCmd(M0P_USART_TypeDef *USARTx,
                            uint32_t u32Func,
                            en_functional_state_t enNewSta)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check USARTx instance */
    if (IS_USART_INSTANCE(USARTx))
    {
        /* Check parameters */
        DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));
        DDL_ASSERT(IS_USART_TRANSMIT_RECEIVE_FUNCTION(u32Func));

        (Enable == enNewSta) ? SET_REG32_BIT(USARTx->CR1, u32Func) : CLEAR_REG32_BIT(USARTx->CR1, u32Func);
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Get USART interrupt state.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_USART1:           USART unit 1 instance register base
 *           @arg M0P_USART2:           USART unit 2 instance register base
 *           @arg M0P_USART3:           USART unit 3 instance register base
 * @param  [in] u32Func                 USART function type
 *         This parameter can be one of the following values:
 *           @arg USART_TX:             USART TX function
 *           @arg USART_INT_RX:         USART RX interrupt function
 *           @arg USART_INT_TC:         USART transmission complete interrupt
 *           @arg USART_INT_TXE:        Transmit data register empty interrupt
 * @retval An en_functional_state_t enumeration value:
 *           - Enable: Enable function
 *           - Disable: Disable function
 */
en_functional_state_t USART_GetFuncState(M0P_USART_TypeDef *USARTx,
                            uint32_t u32Func)
{
    /* Check parameters */
    DDL_ASSERT (IS_USART_INSTANCE(USARTx));
    DDL_ASSERT(IS_USART_TRANSMIT_RECEIVE_FUNCTION(u32Func));

    return (READ_REG32_BIT(USARTx->CR1, u32Func) ? Enable : Disable);
}

/**
 * @brief  Get USART flag.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_USART1:           USART unit 1 instance register base
 *           @arg M0P_USART2:           USART unit 2 instance register base
 *           @arg M0P_USART3:           USART unit 3 instance register base
 * @param  [in] u32Flag                 USART flag type
 *         This parameter can be one of the following values:
 *           @arg USART_FLAG_PE:        Parity error flag
 *           @arg USART_FLAG_FE:        Framing error flag
 *           @arg USART_FLAG_ORE:       Overrun error flag
 *           @arg USART_FLAG_RXNE:      Receive data register not empty flag
 *           @arg USART_FLAG_TC:        Transmission complete flag
 *           @arg USART_FLAG_TXE:       Transmit data register empty flag
 *           @arg USART_FLAG_MPB:       Receive processor ID flag
 * @retval An en_flag_status_t enumeration value:
 *           - Set: Flag is set
 *           - Reset: Flag is reset
 */
en_flag_status_t USART_GetFlag(M0P_USART_TypeDef *USARTx, uint32_t u32Flag)
{
    /* Check parameters */
    DDL_ASSERT(IS_USART_INSTANCE(USARTx));
    DDL_ASSERT(IS_USART_FLAG(u32Flag));

    return (READ_REG32_BIT(USARTx->SR, u32Flag) ? Set : Reset);
}

/**
 * @brief  Get USART flag.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_USART1:           USART unit 1 instance register base
 *           @arg M0P_USART2:           USART unit 2 instance register base
 *           @arg M0P_USART3:           USART unit 3 instance register base
 * @param  [in] u32Flag                 USART flag type
 *         This parameter can be any composed value of the following values:
 *           @arg USART_CLEAR_FLAG_PE:  Clear Parity error flag
 *           @arg USART_CLEAR_FLAG_FE:  Clear Framing error flag
 *           @arg USART_CLEAR_FLAG_ORE: Clear Overrun error flag
 * @retval An en_result_t enumeration value:
 *           - Ok: Clear successfully
 *           - ErrorInvalidParameter: USARTx is invalid instance
 */
en_result_t USART_ClearFlag(M0P_USART_TypeDef *USARTx, uint32_t u32Flag)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check USARTx instance */
    if (IS_USART_INSTANCE(USARTx))
    {
        /* Check parameters */
        DDL_ASSERT(IS_USART_CLEAR_FLAG(u32Flag));

        SET_REG32_BIT(USARTx->CR1, u32Flag);
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Set USART silence mode.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_USART1:           USART unit 1 instance register base
 *           @arg M0P_USART2:           USART unit 2 instance register base
 *           @arg M0P_USART3:           USART unit 3 instance register base
 * @param  [in] enNewSta                The function new state.
 *           @arg  This parameter can be: Enable or Disable.
 * @retval An en_result_t enumeration value:
 *           - Ok: Set successfully
 *           - ErrorInvalidParameter: USARTx is invalid instance
 */
en_result_t USART_SilenceModeCmd(M0P_USART_TypeDef *USARTx, en_functional_state_t enNewSta)
{
    en_result_t enRet = ErrorInvalidParameter;

