hdscmcu/hc32m120/DeviceDriverLibrary/hc32m120_ddl/driver/src/hc32m120_usart.c
    /* Check USARTx instance */
    if (IS_USART_INSTANCE(USARTx))
    {
        /* Check parameters */
        DDL_ASSERT(IS_USART_SIGNIFICANT_BIT(u32BitDir));

        MODIFY_REG32(USARTx->CR1, USART_CR1_ML, u32BitDir);
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Get USART bit direction.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_USART1:           USART unit 1 instance register base
 *           @arg M0P_USART2:           USART unit 2 instance register base
 *           @arg M0P_USART3:           USART unit 3 instance register base
 * @retval Returned value can be one of the following values:
 *           @arg USART_MSB:            MSB(Most Significant Bit)
 *           @arg USART_LSB:            LSB(Least Significant Bit)
 */
uint32_t USART_GetBitDirection(M0P_USART_TypeDef *USARTx)
{
    /* Check parameters */
    DDL_ASSERT(IS_USART_INSTANCE(USARTx));

    return READ_REG32_BIT(USARTx->CR1, USART_CR1_ML);
}

/**
 * @brief  Set USART start bit detect polarity.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_USART1:           USART unit 1 instance register base
 *           @arg M0P_USART2:           USART unit 2 instance register base
 *           @arg M0P_USART3:           USART unit 3 instance register base
 * @param  [in] u32Polarity             USART start bit detect polarity
 *         This parameter can be one of the following values:
 *           @arg USART_SB_DETECT_LOW:      Detect RX pin low level
 *           @arg USART_SB_DETECT_FALLING:  Detect RX pin falling edge
 * @retval An en_result_t enumeration value:
 *           - Ok: Set successfully
 *           - ErrorInvalidParameter: USARTx is invalid instance
 */
en_result_t USART_SetSbDetectPolarity(M0P_USART_TypeDef *USARTx,
                                            uint32_t u32Polarity)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check USARTx instance */
    if (IS_USART_INSTANCE(USARTx))
    {
        /* Check parameters */
        DDL_ASSERT(IS_USART_SB_DETECT_POLARITY(u32Polarity));

        MODIFY_REG32(USARTx->CR1, USART_CR1_SBS, u32Polarity);
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Get USART start bit detect polarity.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_USART1:           USART unit 1 instance register base
 *           @arg M0P_USART2:           USART unit 2 instance register base
 *           @arg M0P_USART3:           USART unit 3 instance register base
 * @retval Returned value can be one of the following values:
 *           @arg USART_SB_DETECT_LOW:      Detect RX pin low level
 *           @arg USART_SB_DETECT_FALLING:  Detect RX pin falling edge
 */
uint32_t USART_GetSbDetectPolarity(M0P_USART_TypeDef *USARTx)
{
    /* Check parameters */
    DDL_ASSERT(IS_USART_INSTANCE(USARTx));

    return READ_REG32_BIT(USARTx->CR1, USART_CR1_SBS);
}

/**
 * @brief  Set USART clock mode.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_USART1:           USART unit 1 instance register base
 *           @arg M0P_USART2:           USART unit 2 instance register base
 *           @arg M0P_USART3:           USART unit 3 instance register base
 * @param  [in] u32ClkMode              USART clock mode
 *         This parameter can be one of the following values:
 *           @arg USART_EXTCLK:             Select external clock source.
 *           @arg USART_INTCLK_OUTPUT:      Select internal clock source and output clock.
 *           @arg USART_INTCLK_NONE_OUTPUT: Select internal clock source and don't output clock
 * @retval An en_result_t enumeration value:
 *           - Ok: Set successfully
 *           - ErrorInvalidParameter: USARTx is invalid instance
 */
en_result_t USART_SetClockMode(M0P_USART_TypeDef *USARTx, uint32_t u32ClkMode)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check USARTx instance */
    if (IS_USART_INSTANCE(USARTx))
    {
        /* Check parameters */
        DDL_ASSERT(IS_USART_CLOCK_MODE(u32ClkMode));

        MODIFY_REG32(USARTx->CR2, USART_CR2_CLKC, u32ClkMode);
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Get USART clock mode.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_USART1:           USART unit 1 instance register base
 *           @arg M0P_USART2:           USART unit 2 instance register base
 *           @arg M0P_USART3:           USART unit 3 instance register base
 * @retval Returned value can be one of the following values:
 *           @arg USART_EXTCLK:             Select external clock source.
 *           @arg USART_INTCLK_OUTPUT:      Select internal clock source and output clock.
 *           @arg USART_INTCLK_NONE_OUTPUT: Select internal clock source and don't output clock
 */
uint32_t USART_GetClockMode(M0P_USART_TypeDef *USARTx)
{
    /* Check parameters */
    DDL_ASSERT(IS_USART_INSTANCE(USARTx));

    return READ_REG32_BIT(USARTx->CR2, USART_CR2_CLKC);
}

/**
 * @brief  Set USART stop bits.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_USART1:           USART unit 1 instance register base
 *           @arg M0P_USART2:           USART unit 2 instance register base
 *           @arg M0P_USART3:           USART unit 3 instance register base
 * @param  [in] u32StopBits             USART stop bits
 *         This parameter can be one of the following values:
 *           @arg USART_STOP_BITS_1:    1 stop bit
 *           @arg USART_STOP_BITS_2:    2 stop bits
 * @retval An en_result_t enumeration value:
 *           - Ok: Set successfully
 *           - ErrorInvalidParameter: USARTx is invalid instance
 */
en_result_t USART_SetStopBits(M0P_USART_TypeDef *USARTx, uint32_t u32StopBits)
{
    en_result_t enRet = ErrorInvalidParameter;

