hdscmcu/hc32m120/DeviceDriverLibrary/hc32m120_ddl/driver/src/hc32m120_usart.c
    /* Check USARTx instance */
    if (IS_USART_INSTANCE(USARTx))
    {
        /* Check parameters */
        DDL_ASSERT(IS_USART_STOP_BITS(u32StopBits));

        MODIFY_REG32(USARTx->CR2, USART_CR2_STOP, u32StopBits);
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Get USART clock mode.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_USART1:           USART unit 1 instance register base
 *           @arg M0P_USART2:           USART unit 2 instance register base
 *           @arg M0P_USART3:           USART unit 3 instance register base
 * @retval Returned value can be one of the following values:
 *           @arg USART_STOP_BITS_1:    1 stop bit
 *           @arg USART_STOP_BITS_2:    2 stop bits
 */
uint32_t USART_GetStopBits(M0P_USART_TypeDef *USARTx)
{
    /* Check parameters */
    DDL_ASSERT(IS_USART_INSTANCE(USARTx));

    return READ_REG32_BIT(USARTx->CR2, USART_CR2_STOP);
}

/**
 * @brief  Set UART half/full duplex selection.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_USART1:           USART unit 1 instance register base
 *           @arg M0P_USART2:           USART unit 2 instance register base
 *           @arg M0P_USART3:           USART unit 3 instance register base
 * @param  [in] u32Mode                 USART half/full duplex selection
 *         This parameter can be one of the following values:
 *           @arg USART_HALFDUPLEX_MODE:USART half-duplex mode
 *           @arg USART_FULLDUPLEX_MODE:USART full-duplex mode
 * @retval An en_result_t enumeration value:
 *           - Ok: Set successfully
 *           - ErrorInvalidParameter: USARTx is invalid instance
 */
en_result_t USART_SetDuplexMode(M0P_USART_TypeDef *USARTx,
                                uint32_t u32Mode)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check USARTx instance */
    if (IS_USART_INSTANCE(USARTx))
    {
        /* Check parameters */
        DDL_ASSERT(IS_UART_DUPLEX_MODE(u32Mode));

        MODIFY_REG32(USARTx->CR3, USART_CR3_HDSEL, u32Mode);
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Get USART half/full duplex.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_USART1:           USART unit 1 instance register base
 *           @arg M0P_USART2:           USART unit 2 instance register base
 *           @arg M0P_USART3:           USART unit 3 instance register base
 * @retval Returned value can be one of the following values:
 *           @arg USART_HALFDUPLEX_MODE:USART half-duplex mode
 *           @arg USART_FULLDUPLEX_MODE:USART full-duplex mode
 */
uint32_t USART_GetDuplexMode(M0P_USART_TypeDef *USARTx)
{
    /* Check parameters */
    DDL_ASSERT(IS_USART_INSTANCE(USARTx));

    return READ_REG32_BIT(USARTx->CR3, USART_CR3_HDSEL);
}

/**
 * @brief  Set UART hardware flow control CTS/RTS selection.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_USART1:           USART unit 1 instance register base
 *           @arg M0P_USART2:           USART unit 2 instance register base
 *           @arg M0P_USART3:           USART unit 3 instance register base
 * @param  [in] u32HwFlowCtrl           USART hardware flow control CTS/RTS selection
 *         This parameter can be one of the following values:
 *           @arg USART_HWFLOWCTRL_CTS: UART hardware flow control CTS mode
 *           @arg USART_HWFLOWCTRL_RTS: UART hardware flow control RTS mode
 * @retval An en_result_t enumeration value:
 *           - Ok: Set successfully
 *           - ErrorInvalidParameter: USARTx is invalid instance
 */
en_result_t USART_SetHwFlowCtrl(M0P_USART_TypeDef *USARTx,
                                uint32_t u32HwFlowCtrl)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check USARTx instance */
    if (IS_USART_INSTANCE(USARTx))
    {
        /* Check parameters */
        DDL_ASSERT(IS_USART_HWFLOWCTRL(u32HwFlowCtrl));

        MODIFY_REG32(USARTx->CR3, USART_CR3_CTSE, u32HwFlowCtrl);
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Get USART hardware flow control CTS/RTS selection.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_USART1:           USART unit 1 instance register base
 *           @arg M0P_USART2:           USART unit 2 instance register base
 *           @arg M0P_USART3:           USART unit 3 instance register base
 * @retval Returned value can be one of the following values:
 *           @arg USART_HWFLOWCTRL_CTS: UART hardware flow control CTS mode
 *           @arg USART_HWFLOWCTRL_RTS: UART hardware flow control RTS mode
 */
uint32_t USART_GetHwFlowCtrl(M0P_USART_TypeDef *USARTx)
{
    /* Check parameters */
    DDL_ASSERT(IS_USART_INSTANCE(USARTx));

    return READ_REG32_BIT(USARTx->CR3, USART_CR3_CTSE);
}

/**
 * @brief  Set USART clock prescaler division.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_USART1:           USART unit 1 instance register base
 *           @arg M0P_USART2:           USART unit 2 instance register base
 *           @arg M0P_USART3:           USART unit 3 instance register base
 * @param  [in] u32PrescalerDiv         USART clock prescaler division.
 *         This parameter can be one of the following values:
 *           @arg USART_CLK_PRESCALER_DIV1:     PCLK
 *           @arg USART_CLK_PRESCALER_DIV4:     PCLK/4
 *           @arg USART_CLK_PRESCALER_DIV16:    PCLK/16
 *           @arg USART_CLK_PRESCALER_DIV64:    PCLK/64
 * @retval An en_result_t enumeration value:
 *           - Ok: Set successfully
 *           - ErrorInvalidParameter: USARTx is invalid instance
 */
en_result_t USART_SetClkPrescaler(M0P_USART_TypeDef *USARTx,
                                    uint32_t u32PrescalerDiv)
{
    en_result_t enRet = ErrorInvalidParameter;

